import type { iCategoryItem, tPreviewsRaw, tReviewsRaw, tStaffRaw } from '../types';

export const mockCategotyItem: iCategoryItem = {
    id: 123,
    img: 'https://kinopoiskapiunofficial.tech/images/posters/kp/535341.jpg',
    name: 'name',
    genres: 'all',
    rating: 5,
    type: 'FILM',
    year: 2014,
    
};

export const mockPersonPreview: tStaffRaw = {
  'staffId': 66539,
  'nameRu': 'Винс Гиллиган',
  'nameEn': 'Vince Gilligan',
  'description': 'Neo',
  'posterUrl': 'https://st.kp.yandex.net/images/actor/66539.jpg',
  'professionText': 'Режиссеры',
  'professionKey': 'DIRECTOR'
};

export const mockFilteredItemsResponse: tPreviewsRaw = {
    'total': 7,
    'totalPages': 1,
    'items': [
      {
        'kinopoiskId': 263531,
        'imdbId': 'tt0050561',
        'nameRu': 'Мстители',
        'nameEn': 'The Avengers',
        'nameOriginal': 'The Avengers',
        'countries': [
          {
            'country': 'США'
          }
        ],
        'genres': [
          {
            'genre': 'фантастика'
          }
        ],
        'ratingKinopoisk': 7.9,
        'ratingImdb': 7.9,
        'year': 2012,
        'type': 'FILM',
        'posterUrl': 'http://kinopoiskapiunofficial.tech/images/posters/kp/263531.jpg',
        'posterUrlPreview': 'https://kinopoiskapiunofficial.tech/images/posters/kp_small/301.jpg'
      },
      {
        'kinopoiskId': 263531,
        'imdbId': 'tt0050561',
        'nameRu': 'Мстители',
        'nameEn': 'The Avengers',
        'nameOriginal': 'The Avengers',
        'countries': [
          {
            'country': 'США'
          }
        ],
        'genres': [
          {
            'genre': 'фантастика'
          }
        ],
        'ratingKinopoisk': 7.9,
        'ratingImdb': 7.9,
        'year': 2012,
        'type': 'FILM',
        'posterUrl': 'http://kinopoiskapiunofficial.tech/images/posters/kp/263531.jpg',
        'posterUrlPreview': 'https://kinopoiskapiunofficial.tech/images/posters/kp_small/301.jpg'
      },
      {
        'kinopoiskId': 263531,
        'imdbId': 'tt0050561',
        'nameRu': 'Мстители',
        'nameEn': 'The Avengers',
        'nameOriginal': 'The Avengers',
        'countries': [
          {
            'country': 'США'
          }
        ],
        'genres': [
          {
            'genre': 'фантастика'
          }
        ],
        'ratingKinopoisk': 7.9,
        'ratingImdb': 7.9,
        'year': 2012,
        'type': 'FILM',
        'posterUrl': 'http://kinopoiskapiunofficial.tech/images/posters/kp/263531.jpg',
        'posterUrlPreview': 'https://kinopoiskapiunofficial.tech/images/posters/kp_small/301.jpg'
      },
      {
        'kinopoiskId': 263531,
        'imdbId': 'tt0050561',
        'nameRu': 'Мстители',
        'nameEn': 'The Avengers',
        'nameOriginal': 'The Avengers',
        'countries': [
          {
            'country': 'США'
          }
        ],
        'genres': [
          {
            'genre': 'фантастика'
          }
        ],
        'ratingKinopoisk': 7.9,
        'ratingImdb': 7.9,
        'year': 2012,
        'type': 'FILM',
        'posterUrl': 'http://kinopoiskapiunofficial.tech/images/posters/kp/263531.jpg',
        'posterUrlPreview': 'https://kinopoiskapiunofficial.tech/images/posters/kp_small/301.jpg'
      },
      {
        'kinopoiskId': 263531,
        'imdbId': 'tt0050561',
        'nameRu': 'Мстители',
        'nameEn': 'The Avengers',
        'nameOriginal': 'The Avengers',
        'countries': [
          {
            'country': 'США'
          }
        ],
        'genres': [
          {
            'genre': 'фантастика'
          }
        ],
        'ratingKinopoisk': 7.9,
        'ratingImdb': 7.9,
        'year': 2012,
        'type': 'FILM',
        'posterUrl': 'http://kinopoiskapiunofficial.tech/images/posters/kp/263531.jpg',
        'posterUrlPreview': 'https://kinopoiskapiunofficial.tech/images/posters/kp_small/301.jpg'
      },
      {
        'kinopoiskId': 263531,
        'imdbId': 'tt0050561',
        'nameRu': 'Мстители',
        'nameEn': 'The Avengers',
        'nameOriginal': 'The Avengers',
        'countries': [
          {
            'country': 'США'
          }
        ],
        'genres': [
          {
            'genre': 'фантастика'
          }
        ],
        'ratingKinopoisk': 7.9,
        'ratingImdb': 7.9,
        'year': 2012,
        'type': 'FILM',
        'posterUrl': 'http://kinopoiskapiunofficial.tech/images/posters/kp/263531.jpg',
        'posterUrlPreview': 'https://kinopoiskapiunofficial.tech/images/posters/kp_small/301.jpg'
      },
      {
        'kinopoiskId': 263531,
        'imdbId': 'tt0050561',
        'nameRu': 'Мстители',
        'nameEn': 'The Avengers',
        'nameOriginal': 'The Avengers',
        'countries': [
          {
            'country': 'США'
          }
        ],
        'genres': [
          {
            'genre': 'фантастика'
          }
        ],
        'ratingKinopoisk': 7.9,
        'ratingImdb': 7.9,
        'year': 2012,
        'type': 'FILM',
        'posterUrl': 'http://kinopoiskapiunofficial.tech/images/posters/kp/263531.jpg',
        'posterUrlPreview': 'https://kinopoiskapiunofficial.tech/images/posters/kp_small/301.jpg'
      },
      {
        'kinopoiskId': 263531,
        'imdbId': 'tt0050561',
        'nameRu': 'Мстители',
        'nameEn': 'The Avengers',
        'nameOriginal': 'The Avengers',
        'countries': [
          {
            'country': 'США'
          }
        ],
        'genres': [
          {
            'genre': 'фантастика'
          }
        ],
        'ratingKinopoisk': 7.9,
        'ratingImdb': 7.9,
        'year': 2012,
        'type': 'FILM',
        'posterUrl': 'http://kinopoiskapiunofficial.tech/images/posters/kp/263531.jpg',
        'posterUrlPreview': 'https://kinopoiskapiunofficial.tech/images/posters/kp_small/301.jpg'
      },
      {
        'kinopoiskId': 263531,
        'imdbId': 'tt0050561',
        'nameRu': 'Мстители',
        'nameEn': 'The Avengers',
        'nameOriginal': 'The Avengers',
        'countries': [
          {
            'country': 'США'
          }
        ],
        'genres': [
          {
            'genre': 'фантастика'
          }
        ],
        'ratingKinopoisk': 7.9,
        'ratingImdb': 7.9,
        'year': 2012,
        'type': 'FILM',
        'posterUrl': 'http://kinopoiskapiunofficial.tech/images/posters/kp/263531.jpg',
        'posterUrlPreview': 'https://kinopoiskapiunofficial.tech/images/posters/kp_small/301.jpg'
      },
      
    ]
  };

  export const mockReviews: tReviewsRaw = {
    'total': 314,
    'totalPages': 16,
    'totalPositiveReviews': 259,
    'totalNegativeReviews': 25,
    'totalNeutralReviews': 30,
    'items': [
      {
        'kinopoiskId': 3191973,
        'type': 'POSITIVE',
        'date': '2022-10-27T18:30:18',
        'positiveRating': 7,
        'negativeRating': 1,
        'author': 'niksolomini',
        'title': 'Философский боевик',
        'description': 'Матрица - это кино, которое в свое время изменило весь кинематограф. Оно показало, что боевики могут нести в себе глубокий философский смысл (даже несколько смыслов), а еще полностью переработало представление об использовании графики, постановке боев и создании аудио эффектов.\r\n\r\nИстория о хакере Нео полна философских мыслей и глубоких отсылок. Основной вопрос таков. \'Сладкая ложь или Колкая правда?\'. И фильм не дает однозначного ответа, поэтому каждый решает всем. Помню, что еще в нулевые все разговаривали о том, какой бы выбор они сделали на месте Нео. Еще меня порадовали явные отсылки на \'Алису в стране чудес\', потому что это мое любимое произведение.\r\n\r\nБоевые сцены до сих пор удивляют своей реалистичностью. Эффект буллет тайм и контактный рукопашный бой до сих пор выглядят на высшем уровне. Если говорить о визуальных эффектах, то зеленый фильтр это просто топовое решение. Еще фильм очень стильный, костюмы героев это прям пушкка. Также радует контраст декораций ( от огромных небоскребов до грязных подземок).\r\n\r\nПо-моему, это вообще лучшая роль Киану Ривза. Вот лучше у него не было. А еще это лучшая роль Уивинга. Противостояние их героев вообще считается хрестоматийным.\r\n\r\nИтог. К просмотру рекомендую всем, потому что фильм никого не оставит равнодушным.'
      },
      {
        'kinopoiskId': 3115023,
        'type': 'POSITIVE',
        'date': '2022-01-13T19:39:42',
        'positiveRating': 13,
        'negativeRating': 2,
        'author': 'devalmont',
        'title': 'What is the Matrix?',
        'description': '«Матрица» – главный фильм моего поколения, в значительной степени изменивший кинематограф как искусство. Справедливо будет сказать, что именно «Матрица» стала точкой отсчёта для кинематографа XXI века, поэтому я считаю возможной только максимальную оценку.\r\n\r\nСказать, что это мой любимый фильм, я не могу, но его визуальный стиль безупречен и вызывает неподдельное восхищение. Качество экшена значительно превзошло своё время, некоторые сцены вызывают искренний восторг даже в наши дни, спустя двадцать лет технического прогресса.\r\n\r\nФилософский сценарий с интересной концепцией и обилием культурных отсылок легко критиковать сегодня, но это вполне достойная история. Следует отдельно отметить идею двух таблеток – выбор между мучительной правдой и блаженной иллюзией, она раскрыта максимально наглядно.\r\n\r\nВ аспекте персонажей – вне всякого сомнения, это главная роль Киану Ривза, даже с учётом того, что уже вышли «На гребне волны» (прообраз франшизы «Форсаж») и великий «Адвокат дьявола» с Аль Пачино и Шарлиз Терон. Впрочем, лично на меня наибольшее впечатление произвела Кэрри-Энн Мосс в роли Тринити – невероятно сильный и прекрасный образ женщины, один из моих любимых.\r\n\r\n10 из 10'
      },
      {
        'kinopoiskId': 3104576,
        'type': 'NEUTRAL',
        'date': '2021-12-19T18:13:04',
        'positiveRating': 19,
        'negativeRating': 57,
        'author': 'poisoNDealer-',
        'title': 'Не прошёл проверку временем',
        'description': 'Я из тех людей, которые не смотрели этот фильм в детстве, но посмотрели в зрелом возрасте. Конечно, это не было таким натуральным просмотром с нуля, в моей голове уже были имена и лица главных героев, их знаменитые фразы, даже целые сцены из фильма, а также знание того, что на “Матрице” уже много лет висит ярлык “культовое кино”. И после просмотра хочу сказать, что последнее меня огорчает больше всего. И это ваше культовое кино? А фильмы про Рэмбо тоже культовые? А, ну да...\r\n\r\nВсё-таки сразу хочется отметить визуальную часть фильма. С поправкой на возраст ленты, всё смотрится очень хорошо. Спецэффекты, атмосфера, музыка, сцены боёв. Только за это большой жирный плюс.\r\n\r\nПо поводу сюжета. Ну… если рассматривать это как некое рядовое научно-фантастическое произведение в вакууме, то “Матрица” выглядит достойным представителем жанра. Но если пытаться углядеть в ней какую-нибудь философскую антиутопию, художественное воспроизведение гипотезы симуляции, или драму о свернувшем не туда человечестве, то сразу бросается в глаза какая-то общая тривиальность всего сказанного и показанного.\r\n\r\nКак я уже говорил, я посмотрел “Матрицу” в зрелом возрасте, и перед этим был в моей жизни период, когда я увлекался гипотезой симуляции и связанными с этим вещами, читал и слушал некоторые изыскания по этой теме. Возможно поэтому вся эта “глубокая” философия фильма не произвела на меня никакого впечатления. После просмотра, осталось лишь некое послевкусие даже не вторичности, а примитивности, в какой-то степени наивности вплетённых в сюжет фильма идей.\r\n\r\nЯ понимаю, почему “Матрица” могла произвести эффект разорвавшейся бомбы в момент своего выхода, среди людей, находившихся в ожидании прихода нового миллениума, людей того времени и того образа жизни. Но я не понимаю, почему спустя почти четверть века кто-то продолжает рассказывать о некой суперфилософской суперфилософии этого фильма.  Меня пугают современные восторженные отзывы о том, как фильм своими глубокими идеями кому-то, так сказать, “взорвал мозг”, или о том, как он заставил задуматься над увиденным. С моей точки зрения, для современного человека здесь нет ничего философского, ничего интересного, никакой пищи для размышлений, всё банально и поверхностно. “Матрица” как философское кино своё отжила, не прошла проверку временем. Но, повторюсь, что как представитель хорошей олдскульной некомиксовской фантастики, фильм вполне может хорошо восприниматься и сегодняшнем зрителем. Но не стоит заниматься поиском глубинного смысла, в этом фильме его просто нет.\r\n\r\nА вообще, чем “Матрица” отличается от любого попкорнового кино про супергероев? Только примесью авторского видения гипотезы симуляции. Видения не самого интересного, и не самого прогрессивного. Но, безусловно, самого удобного для потребления массовым зрителем.'
      },
      {
        'kinopoiskId': 3056113,
        'type': 'NEUTRAL',
        'date': '2021-08-08T06:55:25',
        'positiveRating': 21,
        'negativeRating': 40,
        'author': 'Jullan_Fair',
        'title': 'Все включены, всё включено',
        'description': 'Все мальчишки нашего класса сходили с ума по только что вышедшей \'Матрице\', писали о ней сочинения и взахлёб обсуждали спецэффекты. Это было очень, очень давно - больше двадцати лет назад. Слово \'спецэффекты\' неприятно резало слух уже тогда: от него веяло чем-то бездушным, искусственным. \'Матрицу\' я тогда так и не посмотрела. \r\n\r\nЗато посмотрела её теперь как обязательное кино из разряда \'must see\'. Так ли уж обязательно видеть \'Матрицу\'? Да, отвечу я, ибо о таких фильмах нужно составить собственное представление. И я составила его. Поразительно, но те самые спецэффекты, к которым я отнеслась с подозрением в детстве, испортили мне всё впечатление и сейчас, в зрелости. Потому что их здесь слишком много. Непомерно много. Всё происходящее от начала до конца - один сплошной спецэффект.\r\n\r\nЯ признаю зрелищность слоу-мо. А в те времена он вообще был редким явлением и, полагаю, заслуженно стал ассоциироваться с \'Матрицей\', ибо в ней этот приём применяется филигранно. Я совершенно не против сочетания антиутопии и боевика, начинённого восточными единоборствами. Мне нравится главная музыкальная тема фильма - и вообще, надо признать, у него есть стиль. Этот стиль, сконцентрированный на определённых позициях - костюмы, музыка, ключевые сцены, шрифт - моментально впитался в массовое сознание, записался на подкорку общества. Этот фильм стал вроде как легендой - именно благодаря своему стилю. Кто не видел Нео в плаще и тёмных очках, кто не цитировал культовую фразу \'The Matrix has you\'? \r\n\r\nНо мне этого недостаточно. Равно как и блестящей, но не проработанной идеи об иллюзорном мире. В этом амбициозном фильме должно было быть по-бунтарски дерзко всё, от начала до конца. Но на деле я нахожу в нём ряд нелогичных вещей, а также ряд штампов. Возможно, конечно, это моя вина и я просто не постигаю хитроумный замысел авторов. \r\n\r\nПростой обыватель - нерешительный, замкнутый и вечно опаздывающий на работу - вдруг оказывается Избранным. Его ведут к гадалке, названной романтическим названием Пифия.  Степень его крутизны начинает нарастать с пугающей скоростью. В него сейчас же влюбляется самая крутая героиня. Ладно, пропустим. \r\n\r\nНо я так и не поняла, как Нео узнал про Морфеуса (Нео обращается к нему по имени первым, когда имя это ещё не фигурировало в фильме), как вообще люди узнают про Морфеуса, как Морфеус выбирает, кому открыться, как он вышел на Нео и почему он его \'ищет\', по утверждению Тринити, когда сама Тринити уже нашла, как Пифия безнаказанно существовала в Матрице, почему любое появление команды Морфеуса в Матрице не могли засечь сразу. Я не очень разобралась, почему \'агент Смит\' - простая программа, по сути, - вдруг начинает на удивление эмоционально рассуждать о своей ненависти к человечеству. И - самое главное - почему для создания иллюзорного мира машины выбрали именно конец двадцатого века? Почему им не выбрать семнадцатый, двенадцатый, каменный век? Они могли внушить людям что угодно, но почему-то позаботились об их психологическом комфорте и создали довольно продвинутую и комфортную иллюзию. \r\n\r\nИ если уж мы говорим о комфорте - я так и не осознала, есть ли в \'Матрице\' криминал, болезни, коррупция, нищета и роскошь, то есть социальное неравенство. Потому что если есть, процент недовольных своей \'жизнью\' должен быть высок. А это повышает их шансы на пробуждение. \r\n\r\nНо, наверное, больше этих непонятностей меня отвратила идея мгновенного обучения любым премудростям и навыкам. Заслуживает ли это уважения? Нужно просто подключиться к программе и за десять минут стать специалистом в любой области. Сцена, где Тринити за несколько мгновений разучила управление вертолётом, вызвала у меня смех. Простите, но я больше сочувствую героям, которые с мукой добиваются успеха, идут к нему по шипам, добывают мастерство ценой реальных усилий. \r\n\r\nНа мой взгляд, уместно было бы больше говорить в этом фильме о противопоставлении Матрицы и реальности, о нежелании людей сталкиваться с правдой, в которой у них нет ничего, а они сами - лишь источники энергии. Можно было бы вести беседу о гуманности \'пробуждения\', о внутренней борьбе самого героя. Но этого почти нет. Зато есть много драк. Для меня - пожалуй, слишком много драк. \r\n\r\nИ хотя это произведение включено в Национальный реестр фильмов, для меня этот фильм - всего лишь продукт, прогремевший в нужный момент, визуально сложный, грамотно преподнесённый - но неизбежно устаревающий из-за отсутствия глубины и смысла. Матрица, я не увязла в тебе. Прости.'
      },
      {
        'kinopoiskId': 3037842,
        'type': 'POSITIVE',
        'date': '2021-06-14T14:41:03',
        'positiveRating': 29,
        'negativeRating': 10,
        'author': 'КапитанСарказмо',
        'title': 'Не стареет',
        'description': 'На мой взгляд, оригинальная \'Матрица\' в год своего выхода представляла собой примерно то же, что оригинальные \'Звездные войны\'. Это я в плане влияния на моду, популярное кино и видеоигры. Но помимо этого, творения Вачовски и Лукаса многое объединяет - в частности то, что первый фильм не планировался как часть трилогии и был вполне законченной историей. Так или иначе, пересмотрев не так давно и ту, и другую трилогию, я попробую поделиться своими наблюдениями - тогда и сейчас.\r\n\r\nТогда - в год своего выхода - \'Матрица\' умудрилась вобрать в себя все, что считалось крутым на тот момент - компьютеры, хакеров, музыку техно, кожаную одежду, \'очки терминатора\' и добавить к этому собственную фишку, мгновенно ставшую популярной - слоу-мо, то бишь замедление времени и с пролетом камеры вокруг объекта. Герой по прозвищу Нео был этаким Гарри Поттером того поколения, только круче и взрослее - ну потому что из компьютерного гик становился Избранным, расшвыривавшим врагов врукопашную и игнорировавшим правила вселенной.\r\n\r\nСейчас - я вижу, прежде всего, неслабую работу над миром и основной идеей \'Матрицы\'. Да, в основе лежит классическая идея гибели человечества от лап искусственного интеллекта, популяризированная \'Терминатором\', но идея превращения людей в источник энергии с последующим изобретением альтернативной реальности - такого еще особенно никто не видел. По крайней мере, в кино. Хотя есть ближайшие аналоги - например, тот же \'Побег Логана\', но там все несколько иначе. \r\n\r\nЭкшен и рукопашные бои по-прежнему выглядят неплохо. Замедление времени радует глаз - особенно, когда есть материалы по тому, как достигался данный эффект. \r\n\r\nПерсонажи не глупы и мотивированы, Киану Ривз правдоподобен в своей роли. В сюжете не так много времени уделено пророчеству, которое станет проблемой в сиквелах, а заумных разговоров еще нет. В основном, диалоги экспозиционны - ведь Нео новичок в этом мире, и все, что объясняет Морфеус, он объясняет одновременно и зрителю, и ему.\r\n\r\nВ целом, \'Матрица\' - это тот фильм, который однозначно стоит посмотреть хотя бы один раз. Да, за ним закрепилась частично дурная слава - из-за его чрезвычайной популярности в определенный момент времени, которая в наше время именуется \'оверхайпом\'. Но если подойти к фильму объективно, то он вполне заслуживает внимания.'
      },
      {
        'kinopoiskId': 3014479,
        'type': 'POSITIVE',
        'date': '2021-04-07T17:11:20',
        'positiveRating': 16,
        'negativeRating': 2,
        'author': 'Artur_Zaharov',
        'title': 'Культовый фильм',
        'description': 'Думаю, не осталось в мире человека в сознательном возрасте, который не видел хотя бы одну часть Матрицы братьев (а сейчас уже сестер) Вачовски. И дело здесь не в популярности жанра, а в наличии большого количества социально-философских вопросов, преподнесенных в необычном и даже новаторском для того времени виде. Сюжет фильма до сих пор остается одним из самых захватывающих и неординарных сюжетов во всем кинематографе. Хакер Нео узнает, что мир, в котором он живет, ничего большее, чем просто подделка, матрица, подконтрольная искусственному интеллекту, а большинство людей являются для всесильных машин лишь источником энергии, необходимой для их функционирования. Особенно актуально в наше время современных технологий и развития машинного интеллекта, не так ли? А что уж говорить о 1999 году, когда такая неординарная задумка стала почти прорывом. Нео – Избранный, и должен спасти человечество от рабства в матрице. \r\n\r\nВ общем-то, дальнейшие события и разворачиваются на фоне сопротивления небольшой группы восставших людей компьютерным программам. Пересказывать все, а в особенности финал я, естественно, не буду. В этом случаем, действительно, пока сам не увидишь – не поймешь. В ходе развития истории мы знакомимся с другими главными и второстепенными персонажами, в числе которых особенно понравившиеся мне помощник и наставник главного героя Морфеус и один из главных антагонистов картины агент Смит. По моему мнению, именно они были раскрыты наравне с главным персонажем. Возможно, в первой части насчет агента Смита можно еще поспорить, но в следующих фильмах серии он по-настоящему покажет всего себя и станет ведущим злодеем и противником Нео. Сложно сейчас рассказывать только о событиях первой части трилогии, так как мною неоднократно были просмотрены все 3 части. И я бы настоятельно рекомендовал не останавливаться только на одной, так как после завершения просмотра трилогия становится в сознании цельной, хотя и оставляет какие-то вопросы. Некоторые из них даже стали темой для горячих споров зрителей и фанатских теорий. Не буду сильно углубляться в это, но советую почитать про возможную настоящую роль агента Смита в матрице и событиях, разворачивающихся в ней. \r\n\r\nХочу также упомянуть «внешние» технические аспекты фильма. Это, конечно, спецэффекты и монтаж, за которые в далеком двухтысячном году фильм получил премию Оскар. В наши дни они уже не кажутся такими впечатляющими и новаторскими, как в момент выхода, но стоит признать, что для своего времени это был прорыв, да и до сих пор они смотрятся достойно. Не могу не упомянуть тут про ставшую легендарной сцену уворачивания Нео от пуль, которая до сих пор находит отклики в нынешних произведениях поп-культуры. Матрица – это культовый фильм, идеи которого, надеюсь, никогда не устареют. Такая качественная фантастика, я считаю, обязательна к просмотру всем любителям киноискусства.'
      },
      {
        'kinopoiskId': 2995722,
        'type': 'POSITIVE',
        'date': '2021-02-16T15:45:50',
        'positiveRating': 11,
        'negativeRating': 3,
        'author': 'bobuncl',
        'title': 'Как вам хурма мистер Андерсон?',
        'description': 'Почти 22 года назад вышел казалось бы, ничем не примечательный фильм. Снимали этот фильм, малоизвестные два брата режиссёра. И вот этот фильм выйдя в свет собирает космические деньги, охапку \'Оскаров\' и по-настоящему раскрывает режим слоу-мо. Также возводит в ранг суперзвезды актера Хьюго Уивинга. Братья (ныне сестры) Вачовски создали один из культовых фильмов в истории. Потом уже вышли еще два продолжения, но они были уже не такими крутыми. Но самая первая часть до сих пор любима многими людьми. Рецензия на \'Матрицу\' товарищи!\r\n\r\nСюжет: Он был и остается одним из самых крутых сюжетов кинематографа. Хакер Томас Андерсон по прозвищу Нео, днем работает в офисе, а ночью работает хакером. Но потом ему предстоит узнать, что реальность это только иллюзия и понять свое истинное предназначение. В фильме много всяких локаций, в которых происходят самые эпичные сцены фильма. На самом деле сюжет реально очень оригинальный как и для того времени, как и для настоящего времени.\r\n\r\nПерсонажи: Тут все персонажи продуманы, даже самые простые второстепенные. К актерской игре претензий не возникает никаких. Киану Ривз еще очень молодой и играет очень хорошо. Кэрри-Энн Мосс и Лоренс Фишборн тоже играют отлично, но наверное лучше всех тут сыграл Хьюго Уивинг. Он играет очень уверенно и становится очень страшно, когда он появляется в кадре. Всем остальным персонажам в какие-то трагичные моменты, хочется переживать.\r\n\r\nСъемка: Она тут на уровне. Даже сейчас за те же деньги, не могут снять вот так вот, как в данном фильме. Все эти эпичные сцены прекрасны, они очень захватывают дух. \r\n\r\nПо итогу: За довольно таки большие для того времени деньги, получилось очень достойное кино, которое свои \'Оскары\' получило не за красивый постер. И даже спустя 20 с лишним лет, оно не выглядит устаревшим, а наоборот каким-то новаторским, несмотря на то, что спецэффекты сейчас ушли далеко вперед. Смотреть \'Матрицу\' нужно и можно. Жалко что сестры Вачовски, не подарили нам других фильмов похожих на \'Матрицу\', вот поэтому нам остается смотреть эту трилогию и восхищаться ею.\r\n\r\n10 из 10'
      },
      {
        'kinopoiskId': 2974582,
        'type': 'POSITIVE',
        'date': '2020-12-18T15:23:09',
        'positiveRating': 7,
        'negativeRating': 3,
        'author': 'Михаил Еременко - 5977',
        'title': 'Я могу всего лишь показать тебе рецензию - прочитать ее должен ты сам',
        'description': 'Тезис.\r\n\r\nЧто такое “Матрица”? Это отличный боевик с элементами фантастики 1999го года с Киану Ривзом в главной роли. В данной картине были собраны воедино захватывающий сценарий сестер Вачовски, их хорошая постановка экшн сцен с рукопашными боями и перестрелками, отличные актерские работы Киану Ривза и Лоренса Вишберна, украшение картины – молодая Кэрри-Энн Мосс, неплохая работа со светом и цветом и немало атмосферных саундтреков.\r\n\r\nСценарий.\r\n\r\nПо сюжету, главный герой Томас А. Андерсон (Киану Ривз) ведет двойную жизнь: днем он разработчик программного обеспечения в солидной компьютерной компании, а ночью он Нео – известный хакер. День за днем он проводит время в поисках ответа на вопрос “Что такое матрица?” и в один из них, после звонка загадочного “Морфеуса”, он его находит.\r\n\r\nДля начала я скажу о том, что мне понравилось в этом сценарии. Сестры Вачовски умело играли с интригой – в начале фильма вас будет терзать немало вопросов, а во второй его половине вас вовсе ожидает открытый саспенс. Сюжет довольно резво развивается в первой части картины, несколько затормаживает до серединного сюжетного поворота, но быстро набирает темп после. Большую часть фильма сложно оторваться от экрана. \r\n\r\nВ “Матрице” все персонажи, за исключением главного героя и Морфеуса (Лоренс Фишберн) почти не были раскрыты и выступали, как некая декорация к происходящему. По большей части, это не повредило фильму, за исключением его любовной линии между Нео и Тринити (Кэрри-Энн-Мосс), которая вышла несколько спонтанной и неправдоподобной со стороны Нео, который практически не показывал своих чувств в отношении Тринити.\r\n\r\nДанный фильм имеет определенный библейский подтекст. Он выражается через слова агента Смита о том, что первая “Матрица” была идеальным миром, в котором не было место боли и страданиям – корни явно идут из Сада Эдема с Адамом и Евой. Также библейский подтекст виден в том, как Морфеус и его окружение зовут Нео “избранным”, подобно волхвам, нашедшим Иисуса и в самой задаче “избранного” условно спасти человечество, подобно тому же персонажу.\r\n\r\nПостановка(Режиссура).\r\n\r\nТо, что определенно хочется отметить в фильме “Матрицa” – это постановка экшн сцен и в особенности эпизодов с рукопашным боем, пары запоминающихся погонь и нескольких отдельных изобретательных решений при работе с зеркальными поверхностями.\r\n\r\nВ данной картине есть как минимум одна сцена с хорошей перестрелкой – это эпизод в фойе здания, в котором держали Морфеуса. В ней было все: крутые костюмы, уместный “слоумоушн”, тысячи пуль выпущенных в непонятном направлении, зрелищные акробатические номера и взрывной саундтрек.\r\n\r\nЕсли говорить о сценах с рукопашным боем в этом фильме, сразу на ум приходит слово танец. Движения актеров были максимально отточены, чувствовалась сила удара, и до последних мгновений было непросто понять, кто одержит вверх.\r\n\r\nСцены погонь тоже были сняты, как надо: постоянно чувствовалась опасность от надвигающейся угрозы, убегающий все время находил новый путь для побега, а преследователь всегда был не настолько близко, чтобы нагнать героя, но достаточно, чтобы обозначить свое присутствие.\r\n\r\nОтдельно хотелось бы выделить сцену с выбором таблетки, где через отражения в очках главного героя можно было увидеть те самые два варианта и Нео, усилив визуальное различие между красной и синей таблеткой.  \r\n\r\nСвет и цвет.\r\n\r\nСвет в Матрице имеет особое значение и используется для условного разделения пространства в фильме. В освещении картины царствуют три цвета: зеленый, покрывающий все и вся в матрице, синий, главенствующий на летающем корабле и красный, которым залиты человеческие плантации искусственного интеллекта.\r\n\r\nЗеленоватое освещение в матрице передает чувство искусственности окружающего мира и приводит к мыслям о различных зеленых символах, которые можно увидеть на компьютерах героев, отображающих саму “матрицу” в некоторые моменты фильма. \r\n\r\nСиний свет на корабле передает чувство холода, одиночества и страха, которое испытывают герои фильма а, красный человеческих плантаций призван вселять ужас и вызывать неприязнь от этого жуткого зрелища.\r\n\r\nАктерская игра.\r\n\r\nВ Матрице у меня почти не возникло нареканий в отношении актерской игры. Среди всех работ я бы выделил Киану Ривза, Лорэнса Фишберна(Морфеус) и Хьюго Уивинга(Агент Смит) – они особенно органично смотрелись в своих образах.\r\n\r\n Нео веришь с первых минут фильма, его реакция на события довольно правдоподобна (но местами казалось слишком резкой) и не выходит за рамки образа, правда разыграться в этом фильме ему было особо негде. \r\n\r\nС Лорэнсом Фишберном похожая история, но у него была одна сцена, где он хорошо отыграл пытаемого. \r\n\r\nПерсонаж Хьюго мне запомнится надолго не в последнюю очередь благодаря харизме самого актера, но и благодаря его особенной, протяжной манере речи и философским изречениям, кажущимся сейчас рудиментарными.\r\n\r\nРаботы остальных актеров, кроме Кэрри-Энн Мосс (в силу ее чертовской привлекательности в те годы) и Джо Пантольяно (Сайфер) (благодаря немалой роли в сюжете) не запомнились мне и показались довольно блеклыми, в том числе из-за их “декоративности”, продиктованной сценарием.\r\n\r\nКостюмы, монтаж, спецэффекты, саундтреки.\r\n\r\nХотелось бы отдельно поблагодарить художника по костюмам данного фильма за наряды основных персонажей в матрице. Их длинные черные пальто (и обтягивающие кожаные штаны Кэрри-Энн) классно смотрелись в кадре и своим экстравагантным видом показывали, что эти герои явно не из этой эпохи, да и не из этого мира.\r\n\r\nБольшую часть фильма в нем используется стандартный “рваный монтаж” и монтаж с переходами к сцене, однако в нескольких эпизодах вместо него мы имеем пролет через множество символов и вылет в каком-то электронном устройстве – этот переход, в рамках данного мира, смотрелся довольно органично.\r\n\r\nОтдельно стоит выделить спецэффекты, за которые фильм получил премию Оскар в двухтысячном году (равно как и за монтаж). Сейчас они, естественно не выглядят так же впечатляюще, как выглядели в тот год, но смотрятся до сих пор достойно.\r\n\r\nСаундтреки в этом фильме были на уровне, они усиливали напряжение, когда это было необходимо, передавали ощущение погони и задавали темп экшн сценам. Отдельно я бы выделил трек от Rob Zombie в сцене на дискотеке, который я определенно не ожидал услышать в этом фильме.\r\n\r\nИтог.\r\n\r\nПодводя итоги, я скажу, что “Матрица” – это определенно отличное кино, ядреный коктейль с интересными решениями по свету, захватывающим сценарием и режиссурой от сестер Вачовски и культовой актерской работой Киану Ривза. Я бы порекомендовал этот фильм почти каждому, а в особенности фанатам Киану и фантастики.\r\n\r\n8 из 10'
      },
      {
        'kinopoiskId': 2974183,
        'type': 'NEGATIVE',
        'date': '2020-12-17T01:39:45',
        'positiveRating': 18,
        'negativeRating': 113,
        'author': 'холодовская  надежда',
        'title': 'Я выбираю Матрицу!',
        'description': 'Я выбираю Матрицу!\r\n\r\nЛегендарный фильм. Культовый фильм. Культовые образы. Я посмотрела его только что. И знаете, что я скажу? А не увидела я ничего культового, кроме имен в касте. \r\n\r\nНачну с сюжета. Два часа невнятного экшена можно описать одной фразой \'Группа повстанцев в постапокаллиптическом мире хочет вернуть людей из матрицы сновидений в реальный мир, полный роботов, проблем, ужасов, в котором нет ни еды, ни солнца, ни места для жизни\'. Для чего? Я совершенно не поняла. Может быть, об этом расскажут следующие части. Но я искренне не хочу их смотреть. Мне жаль два часа времени на фильм ни о чем. Еще один глобальный вопрос по сюжету: Зачем затягивать небо тучами и лишать людей нормальной жизни, когда проще уничтожить роботов? Еще одно замечание по сюжету - зачем так глупо себя вести в Матрице после обучения в реальном мире? Это касается всей группы повстанцев и Агентов. \r\n\r\nЧто касается игры актеров - не вызывает никаких восторгов, хотя имена значимые для современного кинематографа. Особенно Киану Ривз разочаровал в этой роли. Совершенно тусклый, бледный и никакой Нео. Другие его фильмы гораздо интереснее. \r\n\r\nЭффекты - для меня совершенно лишнее достижение кинематографа. Траты бюджета огромные, хронометраж колоссальный, а толку ноль. Никакого смысла в них нет. Гораздо приятнее смотреть фильмы, снятые без спецэффектов, где все тянут на себе актеры и съемочная бригада, а не нарисованная компьютером графика. \r\n\r\nЕдинственный плюс - достаточно интересная сама идея Матрицы и использование людей как ресурсов. Впрочем, в этой идее очень много логических косяков, если в нее начинаешь вдумываться. Да и новизной здесь и не пахнет. Идея о мире, покоренном искусственным разумом, описана много десятилетий назад целой плеядой фантастов разных стран. \r\n\r\nДа, кстати, я бы выбрала жизнь в Матрице, но не возвращаться в мир реальности, где нечего кушать, негде жить, не светит Солнце и беснуются роботы.\r\n\r\nТолько за достаточно свежую идею о Матрице ставлю свои баллы\r\n\r\n3 из 10'
      },
      {
        'kinopoiskId': 2965537,
        'type': 'POSITIVE',
        'date': '2020-11-15T07:33:49',
        'positiveRating': 7,
        'negativeRating': 0,
        'author': 'Wikia',
        'title': 'Кино-легенды. Часть 5. Матрица',
        'description': 'Что такое Матрица? Уверена, что такой вопрос задавал себе каждый, кто слышал об этом фильме, но еще ни разу его не видел. Как и я в середине 2000х годов. Ведь посмотреть Матрицу мне удалось примерно через 9-10 лет после премьеры. Впечатления - просто феноменальные. Что неудивительно - ведь Матрица является одним из тех фильмов, которые формируют новую философию, моментально приобретают культовый статус и оказывают огромное влияние на поколение киноманов.\r\n\r\n<i>Случалось видеть сон, казавшийся реальностью? Что, если бы ты не смог проснуться? Как бы ты узнал, что такое сон, а что действительность?</i>\r\n\r\nТомас Андерсон кажется самым обычным офисным работником. А по ночам он становится хакером Нео, который ищет ответ на давно мучающий его вопрос: Что такое Матрица? С помощью Морфеуса, которого разыскивают по подозрениям в терактах, и его помощницы Тринити, Нео узнает страшную правду: Матрица - это иллюзорный мир, созданный искусственным интеллектом, к которому с рождения подключают людей, чтобы те питали свой энергией машины. А сам Нео не просто еще один человек, разбуженный из неизвестного рабства: он - Избранный, который согласно пророчеству должен освободить людей от Матрицы и положить конец господству машин.\r\n\r\n<i>- Не пытайся согнуть ложку; это невозможно. Вместо этого, попытайся понять главное.\r\n- Что — главное?\r\n- Ложки не существует.</i>\r\n\r\nПомнится, я даже аннотацию к фильму не читала - знала только что герои там бегают по стенам, кадры застывают в середине сцены и, конечно, о знаменитых зеленых сияющих строчках кода, бегущих сверху вниз. Поэтому я была совершенно не готова к тому, что нам показали в Матрице (пока еще) <b>братья Вачовски</b>. Мы видим сразу два мира: обыденный и привычный нам, который мы видим каждый день, и ужасающий и холодный мир будущего, где машины правят миром... Но не думайте, что это просто фильм смеси жанров постапокалиптика и киберпанк. В Матрице заложена целая философия, идеи и вопросы, которые до сих пор остаются весьма актуальными, а местами и пугающими: что есть реальность? Действительно ли мы свободны? А что если это все действительно сон? Ведь хоть это и фантастика, но в реальной жизни все идет по довольно похожему сценарию... \r\n\r\n<i>Что есть реальность? И как определить её? Есть набор ощущений, зрительных, осязательных, обонятельных — это сигналы рецепторов, электрические импульсы, воспринятые мозгом.</i>\r\n\r\nСтилистика Матрицы - это следующее, что покорило миллионы киноманов по всему миру. Только недавно я заметила определенную цветовую гамму двух миров фильма: зеленоватый для Матрицы и бледно-голубой для реальности. Такие детали добавляют фильму еще больше эффектности и визуальной красоты. Как и сцены сражений, которые тогда в 1999 году открыли новый захватывающий способ поразить зрителей. Я говорю про знаменитую замедленную съемку и поворот кадра на 180 градусов в момент прыжка в стиле журавля, полета между зданиями и легендарной сцены уклонения от пуль. А спецэффекты в сценах, показывающих реальный мир, где солнце скрыто за грозовыми тучами, а также сами машины-охотники - это и впечатляет, и пугает одновременно. Как и мрачный, пугающий и захватывающий саундтрек <b>Дона Дэвиса</b>.\r\n\r\n<i>Вам случалось любоваться Матрицей? Её гениальностью… Миллиарды людей живут полноценной жизнью… во сне.</i>\r\n\r\nМатрица подарила нам 4 воистину иконических образа - герои и злодеи - каждый их которых вошел в списки величайших киноперсонажей всех времен. Томас Андресон, он же Нео (<b>Киану Ривз</b>), Морфеус (<b>Лоуренс Фишберн</b>), Тринити (<b>Кэрри Энн-Мосс</b>) и Агент Смит (<b>Хьюго Уивинг</b>) - прочно ассоциируются у нас с Матрицей, т. к. все четверо являются ее неотъемлемой частью. Нео - спаситель, Избранный, который всю жизнь чувствовал, будто живет во сне, а после настоящего пробуждения, должен адаптироваться к новой, настоящей реальности, а в Матрице - подчинить законы физики и гравитации, чтобы противостоять стражам системы, Агентам, а в результате - пробудить все человечество. Его наставник, проводник с говорящим именем Морфеус (в честь греческого бога сновидений) - открывает ему реальность, учит управлять Матрицей и верит в его предназначение. Тринити - спутница Нео, готовая проследовать за ним куда угодно, даже в самую безрассудную миссию. И главный антагонист всей серии, антипод Нео и его заклятый враг - Агент Смит. Интересно то, что Смит - это не единственная защитная программа Матрица (мы ведь видели других Агентов). Но Смит явно выделяется из всех. В отличие от своих \'собратьев\' он размышляет, философствует на предмет роли человечества в происходящем и главное - о своем отношении к людям. \r\n\r\n<i>Выберешь красную таблетку, останешься в стране чудес, и я покажу, как глубока кроличья нора.</i>\r\n\r\nМатрица - это фильм, который производит двоякое впечатление: ты смотришь фильм с необычным сочетанием страха и восхищения. Страха - потому что все до ужаса напоминает реальный мир, где ты боишься, что все это сон и вот-вот проснешься в постапокалиптическом кошмаре. А восхищения - потому что ты не можешь отвести взгляд от происходящего, которое захватывает дух и поражает наше воображение. Мир, где все возможно - бегать по стенам, замирать в прыжке, уклоняться от пуль и летать. Фильм-легенда.\r\n\r\n10 из 10\r\n\r\n<b>Приятного просмотра!</b>'
      },
      {
        'kinopoiskId': 2947054,
        'type': 'POSITIVE',
        'date': '2020-09-11T18:53:40',
        'positiveRating': 0,
        'negativeRating': 2,
        'author': 'Ev.v.va',
        'title': 'Проникаемость.',
        'description': 'Фильм с первых кадров отталкивает очень яркой и схожей с паранойяльной атмосферой, которая проходит сразу же сквозь зрителя. Тем же он и подсаживает на крючок. Так просто этим проникнуться. \r\n\r\nСитуевина, знакомая каждому, в фильме описывается голубая мечта любого человека - побег от рутины, будучи избранным, и стопроцентное становление великим героем. Концепт заставляет легко эмпатировать главному герою, зритель соотносит его с собой. Особенно пищат дамочки, как я думаю, роль ведь исполняет Киану Ривз, что ему безусловно удается очень живо вывезти.\r\n\r\nКартинка сочная, павильоны атмосферные и крайне продуманные, то, как для конца девяностых выточен и реализован концепт злющего ИИ, вообще заставляет, закусив губу от восхищения, заливаться слюной. \r\n\r\nМузыкальное сопровождение такое же стильное, как и шмотки и поведение главных героев, что-что, а фарса тут ни отнять, ни прибавить. \r\n\r\nИз минусов не очень приятна местами монотонная хореография боев, предсказуемый сюжетный оборот с крысой на палубе, который еще и неудачно был развернут в самой середине фильма, что серьезно повлияло на интригу.\r\n\r\nНо такие незначительные минусы на фоне всеобщего фурора и года выпуска, конечно, сам бог велел простить и отпустить. Фильм - гениален, добротный экшн, трогательные истории, что с Тринити, что с Морфиусом. Здесь и животворящая любовь, и мудрый наставник, и работа в команде. Одним словом все, что нужно сердцу идеалиста, поэтому проникнуться им было легко.'
      },
      {
        'kinopoiskId': 2930852,
        'type': 'POSITIVE',
        'date': '2020-07-11T15:07:47',
        'positiveRating': 4,
        'negativeRating': 0,
        'author': 'nickchernogolovcev77',
        'title': 'Когда цель твоего существования - это лишь чья-то потребность',
        'description': 'В каждом жанре есть фильмы, которые считаются эталоном. На которые многие стараются ровняться, кто-то пытается их превзойти. Среди научной фантастики я бы отметил «Космическую одиссею» конца 60-х, «Бегущего по лезвию» начала 80-х, ну и настоящим прорывом для меня стала «Матрица» на стыке тысячелетий. Один из очень немногих фантастических фильмов, который просто меня поразил, и на то есть несколько причин.\r\n\r\nВо-первых, тот мир, в котором происходят события. Его необычность. Конечно, во всех фантастических фильмах мы видим то, что для нас необычно, но со временем я привык и к инопланетным существам, и к невероятным технологиям. Все эти необычности стали... обычными. Но когда я начал смотреть «Матрицу», я был очень удивлен. С помощью довольно простых, но в то же время оригинальных визуальных решений, создатели фирма смогли погрузить меня в свой выдуманный мир с головой. Костюмы героев, манера их поведения, оттенки цветов в кадрах - все это такие же важные инструменты, как и  компьютерная графика, используемая в боевых сценах.\r\n\r\nВо-вторых, воплощение идеи антиутопии. До «Матрицы» было много фильмов, демонстрирующих, так сказать, управляемость нашего мира кем-то свыше. Но как это сделано здесь, заставило меня испытать хоть и кратковременный, но самый настоящий ужас. Ужас беспомощности множества людей. Ужас их неведения.\r\n\r\nКак по мне, это один из величайших фильмов своего жанра. С удовольствием сказал бы это и про весь кинематограф в целом, но понимаю, что  «Матрица» достаточно специфична. Наверное в ней есть что-то, что может зацепить и не особо ярых любителей фантастики, но универсальным фильмом я бы ее, все же, не назвал.'
      },
      {
        'kinopoiskId': 2929172,
        'type': 'POSITIVE',
        'date': '2020-07-05T10:06:56',
        'positiveRating': 3,
        'negativeRating': 0,
        'author': 'Iron.bird777',
        'title': 'Реально то, что осознаешь ©',
        'description': 'Вы даже не представляете, как сорвало башню одиннадцати летнему человеку! За пару дней до просмотра этого фильма, во дворе мне посчастливилось наблюдать кошку, которая оказалась дежавю. И не просто кошку, а момент, в виде проезжающего уазика, первых капель дождя и той самой кошки. Уверенность в том, что это уже было - зашкаливала. И тут этот фильм. Ну вы поняли, так и отъехать не долго в места не столь отдалённые (нет, в психушку).\r\n\r\nМатрица - звучит так, будто что-то упало, разбилось и посыпалось. Так и есть, картина, вышедшая на рубеже веков, оказалась переломной для кинематографа. Для меня этот фильм оказался знаковым по многим причинам. В первую очередь хочу отметить невероятное погружение/вовлечённость зрителя в происходящее на экране. Пересматривая \'Матрицу\' в разных временных отрезках своей жизни,- не припомню другого фильма, при просмотре которого столько раз всё внутри замирало. При чём каждый раз фокусируешься на разном и находишь действительно свежие мысли. И обусловлено это погружение прежде всего идеей/философией, а точнее подачей. Идея стара, как мир, но её подача была невероятно горячей, в прямом смысле. Например, спецэффекты - обжигающие пули увязающие в пространстве. Или любопытство Нео, словно танцующее на углях, нетерпеливо в своём желании понять и познать суть всего этого. Да и сама идея универсальна в плане того, что её можно обыграть как на глобальном уровне, так и показать личную историю, показать их взаимодействие, раскрыть героя/ев. Всё дополнено экшн сценами с качественным махачем и невероятными спецэффектами, сменяемые вставками-объяснениями философской направленности, в виде конструктивных диалогов с душевными порывами и жадным желанием познания. Конечно, не могу не отметить предельно лаконичную и стильную картинку. Что может быть глубже чёрного цвета, который буквально засасывает... Это и та самая нора неизвестности, и темнота внутренняя, и закрытые глаза спящих, и поглотивший мрак, и бездна, посреди которой блуждает маленькая искра светлого разума.\r\n\r\nИ напоследок, не забываем, что \'печенье хочет любви, как и все остальные\'.'
      },
      {
        'kinopoiskId': 2912391,
        'type': 'POSITIVE',
        'date': '2020-05-13T23:54:51',
        'positiveRating': 2,
        'negativeRating': 0,
        'author': 'Андрей Чувашлов',
        'title': 'То, что кажется реальным, на самом деле, может быть, а может и не быть',
        'description': 'Я впервые в жизни посмотрел \'Матрицу\', спецэффектами меня, конечно, уже не поразишь, оставалось наслаждаться только сюжетом, потому что в актерах я не сомневался. Это первая работа Вачовски, которую я смотрю, и надо сказать, что довольно добротная режиссура, но все-таки самое крепкое, что есть в фильме, это, разумеется сценарий. Сценарий совмещает в себе два пути, которые привлекают зрителей. Первый путь - зрелищность, второй путь - заложенные идеи. И если со зрелищностью все понятно, то я сразу перехожу к идеям, которые неразрывно связаны со сценарием. Во-первых, сценарий максимально прост. Признайтесь, без контекста фильм абсолютно обычный, с банальными поворотными пунктами и без особых вау-эффектов. Подобный путь проделывали сотни героев из мифов и легенд различных наций. \'Тысячеликого героя\' вспомните: зов к приключению, помощник, испытания, помощник, побег, эликсир. Подобный сюжет прост, обрастает различными отсылками к религии и мифологии. Так, весь второй акт - это история о Христе, предательстве и прочем, а большинство персонажей несут имена людей или богов древности. Тем не менее, это история притягивает поднимаемой проблематикой. Где я? Может все вокруг тоже матрица? Вопрос, как говорится, риторический. Но это действительно очень интересная тема для обсуждения, кажущееся такой же абсурдной, сколько правдивой. Ведь, в сущности, все, что происходит в мире, будто подчиненно какому-то непонятному порядку, о существовании которого мы можем только предполагать, но доказать ничего не сможем. Как же выбраться из матрицы? Умереть? Но в таком случае, ты умрешь в компьютерной модели, соответственно, ты вроде как и не умрешь, но умрешь. Сложно? Сложно, теперь я задумываюсь о том, что с удовольствием бы принял синюю таблетку, чтобы забыть об этом фильме. Если честно, даже писать особо ничего не хочется, это рассуждение приведет все равно в никуда, в загроможденную кирпичом стену.\r\n\r\nПлатон сказал, что то, что кажется реальным, на самом деле, может быть нереальным. Возьму на себя ответственность и скажу, что то, что кажется реальным, на самом деле, может быть, а может и не быть. И самое интересное-то что! Ощущение того, что ты - всего лишь создание компьютера разочаровывает, но миллионы людей считают, что их создал бог, но чувствуют восторг. Но это уже другая тема для обсуждения.\r\n\r\nБоюсь, это тупая рецензия, но после просмотра вы поймете, что хотите больше побыть в одиночестве, покурить и подумать, нежели что-то писать, ибо какой во всем смысл, если это матрица, а истины ты так и не узнаешь?'
      },
      {
        'kinopoiskId': 2898341,
        'type': 'POSITIVE',
        'date': '2020-04-12T01:44:16',
        'positiveRating': 7,
        'negativeRating': 0,
        'author': 'Antikinohater',
        'title': 'Реально то, что осознаешь',
        'description': 'Что такое есть реальность? Как ее можно отличить от искусственного мира? Где проходит та самая грань? На все эти вопросы постарается ответить культовый фильм моего детства под названием \'Матрица\'. Давно уже нужно было написать свои мысли об этом кино, но дошел я до него только сейчас. Братья... кхм-кхм... теперь уже сестры Вачовски создали практически образцовый киберпанк, на который до сих пор равняются многие режиссеры.\r\n\r\n<b>Сюжет.</b> Томас Андерсон ведет двойную жизнь. Днем он работает программистом в серьезной компании, а ночами он известен как хакер Нео. Однажды герою предстоит узнать страшную тайну по поводу окружающей его действительности, из-за чего его жизнь навсегда изменится...\r\n\r\nСценарий прописан до мелочей. Авторы придумали целый мир внутри мира, благодаря чему зритель будет рад исследовать его вместе с героями. Здесь не будет неожиданных поворотов сюжета или ошеломляющей концовки: все самые внезапные события произойдут довольно быстро. Зато потом поданную зрителю на блюдечке тему будут стремительно развивать, постепенно вовлекая смотрящего в правила игры данной вселенной.\r\n\r\n<b>Атмосфера.</b> Практически сразу в глаза бровается серая депрессивность картинки, которая этим настраивает на нужный лад. С первых минут экшеновые сцены выглядят до такой степени здорово, что аж дыхание перехватывает. Приятно осознавать, что то, что казалось крутым в детстве, осталось таким же и сейчас. Точная смена ракурсов, великолепные диалоги и превосходная актерская игра <i><b>Киану Ривза</b></i> (Нео), <i><b>Лоуренса Фишборна</b></i> (Морфеус) и <i><b>Керри-Энн Мосс</b></i> (Тринити) буквально заставляет влюбиться в этот фантастический боевик. Кстати, <i><b>Хьюго Уивинг</b></i> (агент Смит) тоже замечательно сыграл свою роль. Перед нами тот самый редкий случай, когда антагонист запоминается не хуже протагониста. Немного расстроили недочеты картины: то у одного из персонажей на теле нет никаких кровоподтеков и ссадин, хотя минуту назад его избивали в Матрице, то след от пули меняет свое начальное положение, то происходит вообще уже что-то запредельное (это я про силу Нео в концовке)... Хорошо, что положительных моментов здесь гораздо больше, поэтому финальное впечатление от просмотра не сильно портится.\r\n\r\n<b>Спецэффекты.</b> Приготовьтесь к мощным взрывам, фатальным разрушениям и бодрым перестрелкам под слоу-мо. Крошиться и ломаться тут будут почти все объекты окружения, создатели явно решили не мелочиться.\r\n\r\n<b>Музыка.</b> Блестящий саундтрек отлично соотносится с философией картины. Выделю любимые композиции <i><b>Rob Zombie - \'Dragula\'</b></i>, <i><b>Lunatic Calm - \'Leave You Far Behind\'</b></i> и <i><b>Rage Against the Machine - \'Wake Up\'</b></i>.\r\n\r\n<b>Итог.</b> Шедевральная лента, которая, безусловно, внесла огромный вклад в будущее фантастических боевиков и навсегда увековечила свое имя среди легендарных картин. К просмотру строго обязательна.\r\n\r\n<b>9 из 10</b>\r\n\r\n(88%), <i>\'Знать путь и идти по нему — не одно и то же...\'</i>'
      },
      {
        'kinopoiskId': 2879700,
        'type': 'NEUTRAL',
        'date': '2020-02-16T07:43:35',
        'positiveRating': 3,
        'negativeRating': 5,
        'author': 'Дегустатор',
        'title': null,
        'description': 'Согласно этому чудо-фильму мир, в котором течёт наша повседневная жизнь, — это не что иное, как компьютерная программа, которая в кругу посвящённых называется матрицей. И наше сознание, к сожалению, чётко синтезировано с этой программой…\r\n\r\nИтак, матрица — это масштабный иллюзорный фарс, искусно созданный неким сверхинтеллектуальным мегакомпьютером специально для тех людей, энергетика которых служит источником питания для этого могущественного электронного подлеца. Непосредственно телесные оболочки людей, подключённых к этому странному устройству, находятся в настоящей реальности, которая этим же мерзавцем давным-давно погружена в безобразный невосстанавливаемый хаос. \r\n\r\nОб этом знают немногие. Только те, кому чудом удалось избежать участи стать аккумуляторами для неестественного сверхразума. На них лежит опасная и сложная миссия — спасать несчастных… У них, естественно, есть свой лидер… На этом можно остановиться, так как остальные детали этой ленты меркнут перед главной интригой — матрицей, и поэтому особой ценности не представляют.\r\n\r\nЭто всё, само собой разумеется, выдумка чистой воды, и мир, в котором мы живём, реален в самой высшей степени, но по всем законам фантастического жанра такое может произойти. И, наверняка, произойдёт. Но не в ближайшем будущем, а примерно через несколько тысяч лет. Наши компьютеры ещё слишком слабы и безвольны, чтобы учудить подобное. \r\n\r\nВот где таится настоящая угроза. Вот кого нужно бояться. Какая там третья мировая война… А вот технические изобретения, созданные людьми как помощники, однажды, превзойдя учёных и неучёных по уровню IQ и физической мощи, могут восстать против своего создателя и отомстить за долгие годы рабского эксплуатирования. По-видимому, всё к этому и идёт…\r\n\r\nА сам фильм очень добротный. Снят он оригинально. Достаточно статичная картинка изобилует приглушёнными тонами, загадочными полутонами. Звуковой ряд так же пестрит \'мистическими\', едва уловимыми обертонами, которые чётко обнаруживаются на общем фоне таинственной тревожной тишины и гула, который сопровождает эту тишину. Это на самом деле очень удачная имитация тишины естественной жизни, которая по мере усиления начинает аж гудеть в ушах. Это всё создаёт эффект как реальности, так и одновременно какой-то нереальности... Такое сочетание позволяет полнее раскрыть и представить зрителю идею главного сюжетного хода.'
      },
      {
        'kinopoiskId': 2876797,
        'type': 'POSITIVE',
        'date': '2020-02-08T01:45:48',
        'positiveRating': 3,
        'negativeRating': 0,
        'author': 'igm2010',
        'title': 'Иллюзорность мира и духовное пробуждение',
        'description': 'Матрица, вероятно, самый культовый фильм из всех, и вряд ли найдется человек, который не слышал об этом фильме или не смотрел его, разве что миллениалы, которые в то время еще не родились, а сейчас еще не успели до него добраться, но в любом случае обязательно видели мемы на тему этого фильма.\r\n\r\nНаш мир - иллюзия. В фильме все пронизано духом <b>восточной философии</b>, которая утверждает иллюзорность нашего мира, Майи. Метафорой духовного пробуждения в фильме является отключение Нео от Матрицы и его самоосознание в реальном мире, где с неба смотрят грозовые тучи, а роботы питаются энергией человечества, погруженного в сон и живущего в компьютерной программе.\r\n\r\nКоманда Навуходоносора, который подбирает очнувшегося Нео, напоминает <b>духовную секту</b>, со своим харизматическим лидером - Морфеусом, под руководством которого они отключают одно за другим людей от Матрицы. Их цель - пробуждение человечества, но рады ли люди этому? Не все. И тут выходит на сцену конфликт. Что лучше - жить в Матрице или в реальном мире? Часть команды остается верной Морфеусу и его идеям, но найдется и предатель, который чуть не погубит дело Морфеуса и жизни его и его команды.\r\n\r\nС подачи фильма многие современные <b>духовные лидеры и учителя</b> используют слово \'Матрица\' применительно к нашей реальности. \'Матрица\' - это наша жизнь, наши увлечения и занятия, события и ситуации, наш трехмерный мир. С точки зрения восточных учений все это не имеющий под собой реального основания сон какого-нибудь индуистского божества. \r\n\r\nНо есть и реальный мир - мир духовности, любви и энергии. В котором можно пробудиться, достигнув <b>духовного просветления</b>, пробуждения. Для этого необходимо выполнять различные духовные практики, читать духовную литературу и ченнелинги (то есть телепатические послания, \'channel\' - в переводе \'канал\') от инопланетян и высших сил, заниматься медитациями и любить окружающий мир.  \r\n\r\nВ первоначальном сценарии мир, в котором пробуждаются люди, отключенные от Матрицы, тоже оказывается <b>еще одной Матрицей</b>, компьютерной программой. Так было бы легче объяснить способности Нео, которые он проявляет не только в Матрице, но и в реальном мире. Но вне фильма, в нашем реальном мире тоже возможны сверхспособности, магия, экстрасенсорика и прочие чудеса.\r\n\r\nМногие люди, посмотрев фильм, начинали тоже называть окружающий мир Матрицей, где все предсказуемо, привычно и обыденно, ничего интересного для многоопытного человека. Таким образом, идеи фильма плотно <b>вошли в культуру</b>. Даже Илон Маск на полном серьезе считает, что наш мир - компьютерная программа, которая, как компьютерная игра, прогружается, простраивается вокруг игрока по мере его перемещения. \r\n\r\nФильм, который никогда не устареет, который стоит посмотреть каждому.\r\n\r\n10 из 10'
      },
      {
        'kinopoiskId': 2875942,
        'type': 'POSITIVE',
        'date': '2020-02-05T21:26:22',
        'positiveRating': 4,
        'negativeRating': 0,
        'author': 'Mister_Christmas',
        'title': '#сел_посмотреть \'Матрица\'',
        'description': 'Исполнилось 20 лет «<i><b>Матрице</b></i>» — коктейлю от <b>родственников Вачовски</b>, который объединил в себе киберпанк, антиутопию, перестрелки, философию и боевые искусства. И справедливо будет сказать, что это один из тех фильмов, который оказал несоизмеримое влияние. Вачовски не только совершили переворот в компьютерных спецэффектах, нет, они взбудоражили умы людей и приобрели огромную фан-базу. Споры о том, реален ли наш мир, или все может быть компьютерной симуляцией, идут до сих пор и в обсуждениях участвуют признанные ученые. \r\n\r\nКогда смотришь фильм, то уже сразу начинаешь подмечать жирный слой символизма. Главный герой — программист Томас Андерсон, известный как хакер Нео (анаграмма к «One») замечает девушку с татуировкой белого кролика (\'Алиса в стране чудес»), которая выводит его на Морфеуса — признанного властями многих стран опасного преступника. Морфеус рассказывает Нео, что мир, в котором он существует — всего лишь компьютерная симуляция, реальность гораздо ужаснее. А Морфеус возглавляет группу повстанцев, которая борется с роботами, живет на корабле с названием «Навуходоносор» и верит в появление Избранного, который, согласно затертому до дыр пророчеству, спасет мир. И все ведет к тому, что этим Избранным является мистер Андерсон…\r\n\r\nЭто сейчас про актерский состав говорят, что они довольно известны. Если пролистать их фильмографии, то под ранг известных имен того времени попадал <b>Киану Ривз</b>, снявшийся в культовом «<i><b>Адвокате дьявола</b></i>» и <b>Лоуренс Фишберн</b>, который за 20 лет до «Матрицы» сыграл в «<i><b>Апокалипсисе сегодня</b></i>». А про <b>Кэрри Энн-Мосс</b> и <b>Хьюго Уивинга</b>, как бы помягче сказать, знали не все. Каждый из актеров старательно гнет свою линию. <b>Киану</b> несколько каменный, но ужасно крутой. <b>Лоуренс Фишберн</b> серьезен и мудр, переворачивает мировосприятие Нео на 180 градусов. <b>Кэрри Энн-Мосс</b> в роли Тринити, напарницы Нео, также серьезна, но огонек эмоций все же присутствует. Главный гад киноленты агент Смит (<b>Хьюго Уивинг</b>) ходит большую часть времени в темных очках, но все равно мимика его лица заставляет напрягаться. Ему бы в гляделки с Т-1000 поиграть.\r\n\r\nСценарий начали писать еще в то время, когда не существовало Интернета — в 1993 году. И естественно, для того времени не было понятно ничего, что Вачовски написали. От проекта отказывались известные актеры (например, Шон Коннери мог сыграть Морфеуса, но ничего не понял в сценарии). Студия настолько сомневалась в «Матрице», что выделила на съемки 10 миллионов вместо заявленных 80. Создатели просто вложили эти деньги в начальную сцену побега Тринити и показали её продюсерам, что укрепило их уверенность в будущем хите.\r\n\r\nСнимали фильм в Австралии, так что это страна в плане кинематографа может не только Хью Джекманом и Расселом Кроу гордиться. 25 недель съемок, однако этому процессу предшествовали годы подготовки. Тренировки актеров, создание декораций, различные эксперименты… Знаменитую сцену уклонения от пуль делали с помощью компьютерной программы и сотни фотоаппаратов, которые щелкали одновременно. Из фильма убрали голубой цвет неба, чтобы показать, насколько мрачная атмосфера. Эффект замирающей камеры вызвал огромное количество споров, поскольку много режиссеров после выхода фильма заявили, что именно они изобрели эту фишку. Как бы то ни было, но именно Вачовски являются революционерами в этом плане.\r\n\r\nПревозмогая боль и травмы актеров, непонимание съемочной команды и просто кропотливый труд, мы все же можем видеть бессмертную классику, ознаменовавшую собой новую эпоху в кино. Были слухи о перезагрузке франшизы с привлечением на главную роль темнокожего актера. Ребят, если Уилл Смит тогда отказался от главной роли, это не значит, что сейчас можно повторить успех. Мы все уже приняли красные таблетки и смотрим на мир новыми глазами.'
      },
      {
        'kinopoiskId': 2851625,
        'type': 'POSITIVE',
        'date': '2019-11-28T17:48:54',
        'positiveRating': 1,
        'negativeRating': 0,
        'author': 'Mister_Christmas',
        'title': 'Wake up, Neo...',
        'description': 'Исполнилось 20 лет \'Матрице\' - киномясорубке от родственников Вачовски, которая объединила в себе киберпанк, антиутопию, перестрелки, философию и боевые искусства. И справедливо будет сказать, что это один из тех фильмов, который оказал несоизмеримое влияние. Вачовски не только совершили переворот в компьютерных спецэффектах, нет, они взбудоражили умы людей и приобрели огромную фан-базу. Споры о том, реален ли наш мир, или все может быть компьютерной симуляцией, идут до сих пор и в обсуждениях участвуют признанные ученые. Я на полном серьезе говорю.\r\n\r\nКогда смотришь фильм, то уже сразу начинаешь подмечать жирный слой символизма. Главный герой - программист Томас Андерсон, известный как хакер Нео (анаграмма к \'One\') замечает девушку с татуировкой белого кролика (\'Алиса в стране чудес\'), которая выводит его на Морфеуса - признанного властями многих стран опасного преступника. Морфеус рассказывает Нео, что мир, в котором он существует - всего лишь компьютерная симуляция, реальность гораздо ужаснее. А Морфеус возглавляет группу повстанцев, которая борется с роботами, живет на корабле с названием \'Навуходоносор\' и верит в появление Избранного, который, согласно затертому до дыр пророчеству, спасет мир. И все ведет к тому, что этим Избранным является мистер Андерсон...\r\n\r\nЭто сейчас про актерский состав говорят, что они довольно известны. Если пролистать их фильмографии, то под ранг известных имен того времени попадал Киану Ривз, снявшийся в культовом \'Адвокате дьявола\' и Лоуренс Фишберн, который за 20 лет до \'Матрицы\' сыграл в \'Апокалипсисе сегодня\'. А про Кэрри Энн-Мосс и Хьюго Уивинга, как бы помягче сказать, знали не все. Каждый из актеров старательно гнет свою линию. Киану несколько каменный, но ужасно крутой. Лоуренс Фишберн серьезен и мудр, переворачивает мировосприятие Нео на 180 градусов. Кэрри Энн-Мосс в роли Тринити, напарницы Нео, также серьезна, но огонек эмоций все же присутствует. Главный гад киноленты агент Смит (Хьюго Уивинг) ходит большую часть времени в темных очках, но все равно мимика его лица заставляет напрягаться. Ему бы в гляделки с Т-1000 поиграть.\r\n\r\nСценарий начали писать еще в то время, когда не существовало Интернета - в 1993 году. И естественно, для того времени не было понятно ничего, что Вачовски написали. От проекта отказывались известные актеры (например, Шон Коннери мог сыграть Морфеуса, но ничего не понял в сценарии). Студия настолько сомневалась в \'Матрице\', что выделила на съемки 10 миллионов вместо заявленных 80. Создатели просто вложили эти деньги в начальную сцену побега Тринити и показали её продюсерам, что укрепило их уверенность в будущем хите. \r\n\r\nСнимали фильм в Австралии, так что это страна в плане кинематографа может не только Хью Джекманом и Расселом Кроу гордиться. 25 недель съемок, однако этому процессу предшествовали годы подготовки. Тренировки актеров, создание декораций, различные эксперименты... Знаменитую сцену уклонения от пуль делали с помощью компьютерной программы и сотни фотоаппаратов, которые щелкали одновременно. Из фильма убрали голубой цвет неба, чтобы показать, насколько мрачная атмосфера. Эффект замирающей камеры вызвал огромное количество споров, поскольку много режиссеров после выхода фильма заявили, что именно они изобрели эту фишку. Как бы то ни было, но именно Вачовски являются революционерами в этом плане.\r\n\r\nПревозмогая боль и травмы актеров, непонимание съемочной команды и просто кропотливый труд, мы все же можем видеть бессмертную классику, ознаменовавшую собой новую эпоху в кино. Ходят слухи, что сейчас планируют сделать ремейк фильма, и привлечь на главную роль темнокожего актера. Ребят, если Уилл Смит тогда отказался от главной роли, это не значит, что сейчас можно повторить успех. Мы все уже приняли красные таблетки и смотрим на мир новыми глазами.'
      },
      {
        'kinopoiskId': 2839073,
        'type': 'POSITIVE',
        'date': '2019-10-15T09:14:25',
        'positiveRating': 4,
        'negativeRating': 7,
        'author': 'satam',
        'title': 'Очень (не) короткий отзыв',
        'description': 'Спустя 20 лет, культовая Матрица снова на больших экранах. О фильме сказано уже столько, в своё время картина... до сих она остаётся явлением, ни смотря на что. Чего тут уж говорить. Фанаты отыскали все пасхалки и аллюзии (говорят, даже, что некоторые диалоги стали крылатыми, хотя этот момент весьма сомнителен, но слух таков есть), что на западе, что у нас, о ленте есть целые докфильмы - как снималась Матрица. Шутки ли - тот самый секретный сайт, увы, закрылся, а тогда - он тоже был явлением. Вот неполный перечень всех \'баек и небылиц\', про культовую картину. \r\n\r\nЯ же здесь, немного распаять Ваше внимание, уважаемые товарищи Читатели, чтобы немного прожужжать и рассказать свои впечатления, после повторного (и честно скажу - первого) просмотра на большом экране легендарной Матрицы. О сюжете и персонажах, о статусе и философском подтексте (кто-то этот момент, даже оспаривает. Мол - \'картина ни о чём\'. Может быть - любое мнение имеет право быть), картинке и атмосфере и т.д. и т.п. - Вы почитаете (или поглядите) у других пользователей. Тут - совсем коротко (шутка). \r\n\r\nНо вначале (да, я такая большая свинья) - немного истории: как я познакомился с Матрицей. В далёком 99-м, я видел только рекламу (до сих пор помню). Фильм хотелось посмотреть (тем более - он был тогда на слуху). И вот мечта сбылась: в январе 2001-го, в гостях, пока Матушка разговаривала со знакомыми, мне предложили поглядеть: Т2 и Матрицу. В начале был второй вариант. Одна беда сказали мне - \'видик не перематывает\'. Пришлось это делать в ручную. Благо, что кассета была почти вначале, поэтому обошлось без спойлеров (да, мало кто тогда знал, что это такое!). Шутка ли: черно-белый экран, отвратительный перевод и слегка невнятный звук. Но всё равно - жутко понравилось (до сих пор - некоторые моменты - пугают). Только в 2005-м мне удалось поглядеть её (опять на кассете) - в нормальном виде (и в дубляже). А с 2016 года - есть на дисках. Что любопытно: до сих пор помню, как в 2003-м рекламировали второй и третий фильм. А притронулся к ним, только в 2016-м. Хотя у отца были диски \'с особым экраном\' (типа - с \'разных сторон\'). Не знаю... \r\n\r\nТак вот - \'лето 2019\'. Забегая вперёд - снова: я в восторге... Но кое-что немного подпортило впечатление. Во-первых, я искренне (наивно) верил, что рано или поздно её будут крутить, по новомодному - в 3D. Ведь какие здесь спецэффекты и съёмка (и т.д.). Всё круто. Увы - обычная версия. Более того - даже не отреставрированная... Почему? Лове жалко, уважаемые товарищи братья Уорнеры? Почему FOX денег не пожалела и выпустила культовый (не побоюсь этого слова - шедевр... ну, хорошо - \'одну из лучших лент в своём жанре\') Т2, так ещё в 3D и с отличным звуком? Про шедевральный Титаник - я вообще молчу. Вроде как проехали. Правда, такую плёнку, что крутили - я не видел лет 20. Нет, всё по- прежнему - на высоком уровне. Никаких претензий. Даже некоторые немного не дотягивающие до современных стандартов эффекты - всё равно не шибко устарели. И, конечно, не редко, а даже напротив - многое смотрятся ещё очень даже ничего. Но всё равно - это не дело...\r\n\r\nВпрочем, есть и положительные моменты. Один даже нежданный. Только успел сесть в кресло (кстати, народу в кино довольно прилично. Больше чем на Т2) - сразу же начали крутить фильм. Честно! Серьёзно! Обычно по 10, по 15, а то и по 20-30 минут сидим - одна реклама. А тут - сразу начали крутить кино. Уникальный случай. Также, не меньше, что меня порадовало, так это то, что дублированная версия - <b>старая добрая</b>, с привычными голосами (перевод - сами знаете каков). Особо я всегда выделяю Кузнецова и \'земелю\' Вихрова-младшего (Царство ему небесное). С другой стороны, что ещё круче - картину крутят <b>в оригинале</b>. Сбылась моя мечта. Поэтому если надумаете идти... выбор за Вами. Ну и наконец - ничего не вырезано. Собственно и всё...\r\n\r\nБольше сказать нечего. И так уже было всё сказано. Это по-прежнему - <i><b>вся та же Матрица, образца 1999 года</b></i> и, возможно, лучший фильм братьев... то есть сестричек Вачовски. Свои:\r\n\r\n9 из 10\r\n\r\nОна заслужила ещё тогда. И да - её есть за что ненавидеть, есть свои недочеты (и даже - плагиат). С другой стороны - более значимые картины также люто ненавидят. И если на то пошло, то лично мне октябрь - ещё один подарок на день рождение приготовил - \'Спасение из Шоушенка\'. Может ещё Голливуд раскошелиться на \'Унесенные ветром\' или, например, на повторный прокат \'Властелин колец\' или вновь отправимся \'Назад в будущее\' или ещё куда... Как там мама дяди Фёдора сказала? Точно - \'Мы возражать не будем\'. Только рады.\r\n\r\nБлагодарю Всех за внимание. До свидания и удачи.'
      }
    ]
  };